package com.company.Lesson35_Bridge_Persons_OOP.Task02_Persons___factory_metod;

/**
 * Created by Саша on 23.04.2017.
 */
/* User, Looser, Coder and Proger
1. Ввести [в цикле] с клавиатуры несколько строк (ключей).
Строки(ключи) могут быть такими: "user", "looser", "coder", "proger".
Ввод окончен, когда строка не совпадает ни с одной из выше указанных.
1.1. Создать интерфейс Person, в н'м создать 4 вложенных класса:
- User, с методом live() - который выводит на экран строку типа Usually I just live.
- Looser, с методом doNothing() - который выводит на экран строку типа Usually I do nothing.
- Coder, с методом coding() - который выводит на экран строку типа Usually I create code.
- Proger, с методом enjoy() - который выводит на экран строку типа Wonderful life!.
2. Для каждой введенной строки нужно:
2.1. Создать соответствующий объект [см Person.java], например, для строки "user" нужно создать объект класса User.
2.2. Передать этот объект в метод doWork.
3. Написать реализацию метода doWork, который:
3.1. Вызывает метод live() у переданного обекта, если этот объект (person) имеет тип User.
3.2. Вызывает метод doNothing(), если person имеет тип Looser.
3.3. Вызывает метод coding(), если person имеет тип Coder.
3.4. Вызывает метод enjoy(), если person имеет тип Proger.
*/
public interface Person {
    class User implements Person{
        void live(){
            System.out.println("Usually I just live.");
        }
    }
    class Looser implements Person{
        void doNothing(){
            System.out.println("Usually I do nothing.");
        }
    }
    class Coder implements Person{
        void coding(){
            System.out.println("Usually I create code.");
        }
    }
    class Proger implements Person{
        void enjoy(){
            System.out.println("Wonderful life!");
        }
    }
}
