package Questions;

/**
 * Created by Саша on 23.10.2016.
 */
public class jojoj {
    public static void main(String[] args) {
/*

	1. Можно ли сделать одновременно 2 проекта? +
	2. Будет ли плагин от javarush нам мешать? там нужно делать какие то настройки? +
	3. Где хранить куски кода? в самой IDE можно? +
	4. Стоит ли выписывать какую-то информацию? Или все походу ищется в интернете? +
	5. Можно ли сделать учетную программу на компе или веб для учета оборудования на нескольких фирмах.
	(5 офисов, у них компьютеры, телефоны, видеонаблюдение. Нужно знать что где когда куплено,
	как работает, пароли, настройки и какие были изменения)? +
        */
    }
}
