package com.company.Lesson05_Cycle;

/**
 * Created by Саша on 06.11.2016.
 */
/* 10 чисел наоборот
Вывести на экран числа от 10 до 1 используя цикл while.
*/
public class TestCycle02 {
    public static void main(String[] args) {
        int a=10;
        while (a>=1){
            System.out.println(a);
            a--;
        }
    }
}
